cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xS_svd.xml
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description> register FICR </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIE" -->
            <field>
              <name>HANGIE</name>
              <description> bitfield HANGIE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description> bitfield RDYIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description> register FISR </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGIF" -->
            <field>
              <name>HANGIF</name>
              <description> bitfield HANGIF </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description> bitfield RDYIF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description> register FICLR </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HANGC" -->
            <field>
              <name>HANGC</name>
              <description> bitfield HANGC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYC" -->
            <field>
              <name>RDYC</name>
              <description> bitfield RDYC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR1" -->
        <register>
          <name>FSTR1</name>
          <description> register FSTR1 </description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PGMS" -->
            <field>
              <name>PGMS</name>
              <description> bitfield PGMS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SERS" -->
            <field>
              <name>SERS</name>
              <description> bitfield SERS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESPS" -->
            <field>
              <name>ESPS</name>
              <description> bitfield ESPS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CERS" -->
            <field>
              <name>CERS</name>
              <description> bitfield CERS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description> bitfield HNG </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description> bitfield RDY </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description> register CRTRMM </description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTRMM" -->
            <field>
              <name>TTRMM</name>
              <description> bitfield TTRMM </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description> bitfield TRMM </description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "UNIQUE_ID" -->
    <peripheral>
      <name>UNIQUE_ID</name>
      <description> peripheral UNIQUE_ID </description>
      <groupName>UNIQUE_ID</groupName>
      <baseAddress>0x40000200</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UIDR0" -->
        <register>
          <name>UIDR0</name>
          <description> register UIDR0 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID27" -->
            <field>
              <name>UID27</name>
              <description> bitfield UID27 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID26" -->
            <field>
              <name>UID26</name>
              <description> bitfield UID26 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID25" -->
            <field>
              <name>UID25</name>
              <description> bitfield UID25 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID24" -->
            <field>
              <name>UID24</name>
              <description> bitfield UID24 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID23" -->
            <field>
              <name>UID23</name>
              <description> bitfield UID23 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID22" -->
            <field>
              <name>UID22</name>
              <description> bitfield UID22 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID21" -->
            <field>
              <name>UID21</name>
              <description> bitfield UID21 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID20" -->
            <field>
              <name>UID20</name>
              <description> bitfield UID20 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID19" -->
            <field>
              <name>UID19</name>
              <description> bitfield UID19 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID18" -->
            <field>
              <name>UID18</name>
              <description> bitfield UID18 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID17" -->
            <field>
              <name>UID17</name>
              <description> bitfield UID17 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID16" -->
            <field>
              <name>UID16</name>
              <description> bitfield UID16 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID15" -->
            <field>
              <name>UID15</name>
              <description> bitfield UID15 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID14" -->
            <field>
              <name>UID14</name>
              <description> bitfield UID14 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID13" -->
            <field>
              <name>UID13</name>
              <description> bitfield UID13 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID12" -->
            <field>
              <name>UID12</name>
              <description> bitfield UID12 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID11" -->
            <field>
              <name>UID11</name>
              <description> bitfield UID11 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID10" -->
            <field>
              <name>UID10</name>
              <description> bitfield UID10 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID9" -->
            <field>
              <name>UID9</name>
              <description> bitfield UID9 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID8" -->
            <field>
              <name>UID8</name>
              <description> bitfield UID8 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID7" -->
            <field>
              <name>UID7</name>
              <description> bitfield UID7 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID6" -->
            <field>
              <name>UID6</name>
              <description> bitfield UID6 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID5" -->
            <field>
              <name>UID5</name>
              <description> bitfield UID5 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID4" -->
            <field>
              <name>UID4</name>
              <description> bitfield UID4 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID3" -->
            <field>
              <name>UID3</name>
              <description> bitfield UID3 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID2" -->
            <field>
              <name>UID2</name>
              <description> bitfield UID2 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID1" -->
            <field>
              <name>UID1</name>
              <description> bitfield UID1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID0" -->
            <field>
              <name>UID0</name>
              <description> bitfield UID0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UIDR1" -->
        <register>
          <name>UIDR1</name>
          <description> register UIDR1 </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID40" -->
            <field>
              <name>UID40</name>
              <description> bitfield UID40 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID39" -->
            <field>
              <name>UID39</name>
              <description> bitfield UID39 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID38" -->
            <field>
              <name>UID38</name>
              <description> bitfield UID38 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID37" -->
            <field>
              <name>UID37</name>
              <description> bitfield UID37 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID36" -->
            <field>
              <name>UID36</name>
              <description> bitfield UID36 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID35" -->
            <field>
              <name>UID35</name>
              <description> bitfield UID35 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID34" -->
            <field>
              <name>UID34</name>
              <description> bitfield UID34 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID33" -->
            <field>
              <name>UID33</name>
              <description> bitfield UID33 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID32" -->
            <field>
              <name>UID32</name>
              <description> bitfield UID32 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID31" -->
            <field>
              <name>UID31</name>
              <description> bitfield UID31 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID30" -->
            <field>
              <name>UID30</name>
              <description> bitfield UID30 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID29" -->
            <field>
              <name>UID29</name>
              <description> bitfield UID29 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UID28" -->
            <field>
              <name>UID28</name>
              <description> bitfield UID28 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
