cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xS_svd.xml
        <!-- REGISTER "ADCMP_ACCP0" -->
        <register>
          <name>ADCMP_ACCP0</name>
          <description> register ADCMP_ACCP0 </description>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "ADCMP_ACCP1" -->
        <register derivedFrom="ADCMP_ACCP0">
          <name>ADCMP_ACCP1</name>
          <description> register ADCMP_ACCP1 </description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCP2" -->
        <register derivedFrom="ADCMP_ACCP0">
          <name>ADCMP_ACCP2</name>
          <description> register ADCMP_ACCP2 </description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN0" -->
        <register>
          <name>ADCMP_ACCPDN0</name>
          <description> register ADCMP_ACCPDN0 </description>
          <addressOffset>0xA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN1" -->
        <register derivedFrom="ADCMP_ACCPDN0">
          <name>ADCMP_ACCPDN1</name>
          <description> register ADCMP_ACCPDN1 </description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACCPDN2" -->
        <register derivedFrom="ADCMP_ACCPDN0">
          <name>ADCMP_ACCPDN2</name>
          <description> register ADCMP_ACCPDN2 </description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ATSA" -->
        <register>
          <name>ADCMP_ATSA</name>
          <description> register ADCMP_ATSA </description>
          <addressOffset>0xC0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AD0S" -->
            <field>
              <name>AD0S</name>
              <description> bitfield AD0S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD1S" -->
            <field>
              <name>AD1S</name>
              <description> bitfield AD1S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD2S" -->
            <field>
              <name>AD2S</name>
              <description> bitfield AD2S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD0P" -->
            <field>
              <name>AD0P</name>
              <description> bitfield AD0P </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD1P" -->
            <field>
              <name>AD1P</name>
              <description> bitfield AD1P </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD2P" -->
            <field>
              <name>AD2P</name>
              <description> bitfield AD2P </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description> peripheral BTIOSEL03 </description>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description> register BTSEL0123 </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23_" -->
            <field>
              <name>SEL23_</name>
              <description> bitfield SEL23_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01_" -->
            <field>
              <name>SEL01_</name>
              <description> bitfield SEL01_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description> peripheral BTIOSEL47 </description>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description> register BTSEL4567 </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67_" -->
            <field>
              <name>SEL67_</name>
              <description> bitfield SEL67_ </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45_" -->
            <field>
              <name>SEL45_</name>
              <description> bitfield SEL45_ </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
