cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xS_svd.xml
        <!-- REGISTER "IRQ41MON" -->
        <register>
          <name>IRQ41MON</name>
          <description> register IRQ41MON </description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description> bitfield DMAINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ42MON" -->
        <register>
          <name>IRQ42MON</name>
          <description> register IRQ42MON </description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description> bitfield DMAINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ43MON" -->
        <register>
          <name>IRQ43MON</name>
          <description> register IRQ43MON </description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description> bitfield DMAINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ44MON" -->
        <register>
          <name>IRQ44MON</name>
          <description> register IRQ44MON </description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description> bitfield DMAINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ45MON" -->
        <register>
          <name>IRQ45MON</name>
          <description> register IRQ45MON </description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMAINT" -->
            <field>
              <name>DMAINT</name>
              <description> bitfield DMAINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ46MON" -->
        <register>
          <name>IRQ46MON</name>
          <description> register IRQ46MON </description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT15" -->
            <field>
              <name>BTINT15</name>
              <description> bitfield BTINT15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT14" -->
            <field>
              <name>BTINT14</name>
              <description> bitfield BTINT14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT13" -->
            <field>
              <name>BTINT13</name>
              <description> bitfield BTINT13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT12" -->
            <field>
              <name>BTINT12</name>
              <description> bitfield BTINT12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT11" -->
            <field>
              <name>BTINT11</name>
              <description> bitfield BTINT11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT10" -->
            <field>
              <name>BTINT10</name>
              <description> bitfield BTINT10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT9" -->
            <field>
              <name>BTINT9</name>
              <description> bitfield BTINT9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT8" -->
            <field>
              <name>BTINT8</name>
              <description> bitfield BTINT8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT7" -->
            <field>
              <name>BTINT7</name>
              <description> bitfield BTINT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT6" -->
            <field>
              <name>BTINT6</name>
              <description> bitfield BTINT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT5" -->
            <field>
              <name>BTINT5</name>
              <description> bitfield BTINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT4" -->
            <field>
              <name>BTINT4</name>
              <description> bitfield BTINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT3" -->
            <field>
              <name>BTINT3</name>
              <description> bitfield BTINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT2" -->
            <field>
              <name>BTINT2</name>
              <description> bitfield BTINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ47MON" -->
        <register>
          <name>IRQ47MON</name>
          <description> register IRQ47MON </description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0800</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLASHINT" -->
            <field>
              <name>FLASHINT</name>
              <description> bitfield FLASHINT </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL0" -->
        <register>
          <name>RCINTSEL0</name>
          <description> register RCINTSEL0 </description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL3" -->
            <field>
              <name>INTSEL3</name>
              <description> bitfield INTSEL3 </description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL2" -->
            <field>
              <name>INTSEL2</name>
              <description> bitfield INTSEL2 </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL1" -->
            <field>
              <name>INTSEL1</name>
              <description> bitfield INTSEL1 </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL0" -->
            <field>
              <name>INTSEL0</name>
              <description> bitfield INTSEL0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCINTSEL1" -->
        <register>
          <name>RCINTSEL1</name>
          <description> register RCINTSEL1 </description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTSEL7" -->
            <field>
              <name>INTSEL7</name>
              <description> bitfield INTSEL7 </description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL6" -->
            <field>
              <name>INTSEL6</name>
              <description> bitfield INTSEL6 </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL5" -->
            <field>
              <name>INTSEL5</name>
              <description> bitfield INTSEL5 </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSEL4" -->
            <field>
              <name>INTSEL4</name>
              <description> bitfield INTSEL4 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
