cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xS_svd.xml
        <!-- REGISTER "RCADR2" -->
        <register>
          <name>RCADR2</name>
          <description> register RCADR2 </description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCADR2" -->
            <field>
              <name>RCADR2</name>
              <description> bitfield RCADR2 </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCADR1" -->
        <register>
          <name>RCADR1</name>
          <description> register RCADR1 </description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCADR1" -->
            <field>
              <name>RCADR1</name>
              <description> bitfield RCADR1 </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTHL" -->
        <register>
          <name>RCDTHL</name>
          <description> register RCDTHL </description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTHL" -->
            <field>
              <name>RCDTHL</name>
              <description> bitfield RCDTHL </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTHH" -->
        <register>
          <name>RCDTHH</name>
          <description> register RCDTHH </description>
          <addressOffset>0x51</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTHH" -->
            <field>
              <name>RCDTHH</name>
              <description> bitfield RCDTHH </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTLL" -->
        <register>
          <name>RCDTLL</name>
          <description> register RCDTLL </description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTLL" -->
            <field>
              <name>RCDTLL</name>
              <description> bitfield RCDTLL </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTLH" -->
        <register>
          <name>RCDTLH</name>
          <description> register RCDTLH </description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTLH" -->
            <field>
              <name>RCDTLH</name>
              <description> bitfield RCDTLH </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCCKD" -->
        <register>
          <name>RCCKD</name>
          <description> register RCCKD </description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKSEL" -->
            <field>
              <name>CKSEL</name>
              <description> bitfield CKSEL </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CKDIV" -->
            <field>
              <name>CKDIV</name>
              <description> bitfield CKDIV </description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCRHW" -->
        <register>
          <name>RCRHW</name>
          <description> register RCRHW </description>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCRHW" -->
            <field>
              <name>RCRHW</name>
              <description> bitfield RCRHW </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCRC" -->
        <register>
          <name>RCRC</name>
          <description> register RCRC </description>
          <addressOffset>0x5D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x11</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCIE" -->
            <field>
              <name>RCIE</name>
              <description> bitfield RCIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RC" -->
            <field>
              <name>RC</name>
              <description> bitfield RC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCLE" -->
        <register>
          <name>RCLE</name>
          <description> register RCLE </description>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LELIE" -->
            <field>
              <name>LELIE</name>
              <description> bitfield LELIE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LESIE" -->
            <field>
              <name>LESIE</name>
              <description> bitfield LESIE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LELE" -->
            <field>
              <name>LELE</name>
              <description> bitfield LELE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LESE" -->
            <field>
              <name>LESE</name>
              <description> bitfield LESE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EPE" -->
            <field>
              <name>EPE</name>
              <description> bitfield EPE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LEL" -->
            <field>
              <name>LEL</name>
              <description> bitfield LEL </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LES" -->
            <field>
              <name>LES</name>
              <description> bitfield LES </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
