cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xS_svd.xml
        <!-- REGISTER "UPINT_CLR" -->
        <register>
          <name>UPINT_CLR</name>
          <description> register UPINT_CLR </description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSC" -->
            <field>
              <name>UPCSC</name>
              <description> bitfield UPCSC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "USBEN" -->
        <register>
          <name>USBEN</name>
          <description> register USBEN </description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USBEN" -->
            <field>
              <name>USBEN</name>
              <description> bitfield USBEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USB0" -->
    <peripheral>
      <name>USB0</name>
      <description> peripheral USB0 </description>
      <groupName>USB0</groupName>
      <baseAddress>0x40040000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x2100</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2104</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2108</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2110</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2114</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2118</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x211C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2120</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2124</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2128</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x212C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2130</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2134</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2138</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x213C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2140</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2144</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2148</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x214C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2150</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2154</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2158</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x215C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2160</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2164</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2168</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x216C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2170</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2174</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "USB0F" -->
      <interrupt>
        <name>USB0F</name>
        <value>34</value>
      </interrupt>
      <!-- INTERRUPT "USB0F_USB0H" -->
      <interrupt>
        <name>USB0F_USB0H</name>
        <value>35</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UDCC" -->
        <register>
          <name>UDCC</name>
          <description> register UDCC </description>
          <addressOffset>0x2120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00A0</resetValue>
          <resetMask>0x00FB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RST" -->
            <field>
              <name>RST</name>
              <description> bitfield RST </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RESUM" -->
            <field>
              <name>RESUM</name>
              <description> bitfield RESUM </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HCONX" -->
            <field>
              <name>HCONX</name>
              <description> bitfield HCONX </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USTP" -->
            <field>
              <name>USTP</name>
              <description> bitfield USTP </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STALCLREN" -->
            <field>
              <name>STALCLREN</name>
              <description> bitfield STALCLREN </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFBK" -->
            <field>
              <name>RFBK</name>
              <description> bitfield RFBK </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PWC" -->
            <field>
              <name>PWC</name>
              <description> bitfield PWC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP0C" -->
        <register>
          <name>EP0C</name>
          <description> register EP0C </description>
          <addressOffset>0x2124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0x027F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description> bitfield STAL </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS0" -->
            <field>
              <name>PKS0</name>
              <description> bitfield PKS0 </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1C" -->
        <register>
          <name>EP1C</name>
          <description> register EP1C </description>
          <addressOffset>0x2128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description> bitfield EPEN </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description> bitfield TYPE </description>
              <lsb>13</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description> bitfield DIR </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description> bitfield DMAE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description> bitfield NULE </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description> bitfield STAL </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description> bitfield PKS </description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
